[
  {
    "id": 1,
    "name": "ParkingTix",
    "date": "2023",
    "paragraphs": [
      "ParkingTix is a web app for automatically contesting parking tickets. It is an experiment into the concept of anti-dark-patterns design using AI.",
      "It utilises the OpenAI chat completions api, and the Gmail api to generate and send appeal emails.",
      "The dashboard tracks the progress of appeals, and is used to view the email history for each thread.",
      "Users generate and send responses to incoming emails through the app- who will give in first?",
      "This was made collaboratively during the final week of a coding bootcamp.",
      "ParkingTix is not currently deployed, but you can "
    ],
    "images": [
      {
        "path": "/images/parking-tix_0.png",
        "altText": "ParkingTix landing page",
        "caption": "ParkingTix landing page"
      },
      {
        "path": "/images/parking-tix_1.png",
        "altText": "ParkingTix disputes page",
        "caption": "ParkingTix disputes page"
      },
      {
        "path": "/images/parking-tix_2.png",
        "altText": "ParkingTix dashboard",
        "caption": "ParkingTix dashboard"
      }
    ],
    "links": ["https://github.com/Chrisp-Swanch/parking-tix"]
  },
  {
    "id": 2,
    "name": "Grey Ghost",
    "date": "2020",
    "paragraphs": [
      "Grey Ghost is an interactive exhibit, based around the story of the south island kōkako. It makes use of a custom-built arduino touch sensor system, and Unreal Engine.",
      "It was developed as a conceptual piece to explore the role of digital interactivity in a museum context.",
      "The user can explore a virtual forest, responding to visual and sound queues, to find the bird and learn its story. The gamified nature of the exhibit is inspired by real-world efforts to locate the species.",
      "This is a solo project, made during my final year at university. A variety of 2D and 3D softwares were implemented to realise the design, as well as electronics, programming and fabrication."
    ],
    "images": [
      {
        "path": "/images/grey-ghost_0.jpeg",
        "altText": "Grey Ghost landing",
        "caption": "Grey Ghost landing screen, showing rear projection display and touch interface"
      },
      {
        "path": "/images/grey-ghost_1.jpeg",
        "altText": "Grey Ghost forest scene",
        "caption": "Grey Ghost forest scene"
      }
    ],
    "links": []
  }
]